[
    {
        "title": "Blokklánc tranzakciós gráfok típusfelismerése képalapú hasonlóságméréssel",
        "description": "A dolgozat célja különböző tranzakciós minták (pl. sok-bemenet/sok-kimenet, fan-in/fan-out, keverésre utaló struktúrák) automatikus azonosítása a tranzakciós gráfok renderelt képei alapján. A rendszer képgenerálást, előfeldolgozást és pixel-/struktúra-alapú hasonlósági metrikákat használ, majd kiértékeli, milyen pontossággal különíthetők el a mintázatok.",
        "taken": false
    },
    {
        "title": "Anomáliadetektálás blokklánc tranzakciós hálózatokban vizuális ujjlenyomatokkal",
        "description": "A téma egy olyan megközelítést vizsgál, ahol a tranzakciós algráfokból vizuális ujjlenyomat készül, és ehhez képest az outlierek eltérése mérhető. A dolgozatban adatgyűjtés, gráf-szeletelés, kép-alapú összehasonlítás és anomáliák rangsorolása történik, majd esettanulmányokkal (szokatlan forgalom, csomóponti kiugrás) validál.",
        "taken": false
    },
    {
        "title": "Adatvédelmi modell tervezése blokklánc-alapú egészségügyi rendszerekhez: off-chain tárolás + on-chain bizonyíthatóság",
        "description": "A téma olyan architektúrát tervez és értékel, amely érzékeny adatokat nem közvetlenül láncon tárol, hanem off-chain megoldással (pl. titkosított adattár), miközben on-chain rögzíti az integritást és a hozzáférési eseményeket. A dolgozat célja a megfelelőség, az auditálhatóság és a rendszerterhelés összehangolása.",
        "taken": false
    },
    {
        "title": "Rövid videós tartalmak sikerének előrejelzése: idősoros és tartalomfüggetlen engagement minták elemzése",
        "description": "A dolgozat nagy mintán (több ezer/tízezer videó) vizsgálja, milyen korai interakciós jelek (nézettség-gyorsulás, like/view arány, kommentdinamika) jelzik a későbbi kiugró teljesítményt. Cél egy egyszerű, magyarázható modell és dashboard, amely a tartalom ismerete nélkül is előrejelzést ad.",
        "taken": false
    },
    {
        "title": "Megtévesztő vélemények detektálása magyar nyelven: transformer alapmodell hibrid (CNN + BiLSTM) kiterjesztéssel",
        "description": "A dolgozat célja egy szövegklasszifikációs rendszer, amely értékeli, mennyire gyanús egy online vélemény. A kutatás összehasonlít több architektúrát (alap transformer vs. kiegészített konvolúciós és BiLSTM réteg), és mérőszámokkal (F1, confusion matrix) elemzi a teljesítményt különböző tanítóhalmazokon.",
        "taken": false
    },
    {
        "title": "Láncolt lista és blokklánc adatstruktúrák teljesítményének összehasonlító elemzése",
        "description": "A feladat egy olyan mérési és elemző keretrendszer megtervezése és megvalósítása, amely a klasszikus láncolt lista és a blokklánc adatstruktúra teljesítményének összehasonlító vizsgálatát teszi lehetővé. A dolgozat keretében a hallgatónak mindkét adatstruktúra működő implementációját el kell készítenie, majd ezek alapján egy olyan benchmark rendszert kell kialakítania, amely képes a legfontosabb műveletek - például az elemek beszúrása, a keresési műveletek végrehajtása, a lánc integritásának ellenőrzése és a memóriahasználat - objektív mérésére. A vizsgálatnak ki kell terjednie arra is, hogy a blokklánc sajátosságai, mint a hash pointerek alkalmazása, az adatok megváltoztathatatlansága és a blokkok közötti kriptográfiai kapcsolatok miként befolyásolják a műveletek költségeit és a rendszer általános hatékonyságát. A mérési eredményeket tudományos igényességgel kell feldolgozni, grafikus vagy táblázatos formában bemutatni, majd összevetni a klasszikus láncolt lista teljesítményével, és ezek alapján következtetéseket kell levonni a két adatstruktúra előnyeiről, hátrányairól és alkalmazhatósági területeiről. A technológiai részletek és specifikációk pontosítása további egyeztetést igényel, a téma véglegesítése előtt konzultáció szükséges.",
        "taken": false
    },
    {
        "title": "Zero-knowledge alapú identitásvalidáció blokklánc-alapú mikroszolgáltatásként",
        "description": "A feladat egy olyan keretrendszer létrehozása, amely lehetővé teszi a felhasználói identitások hitelesítését zero-knowledge módszerekkel, blokklánc-alapú mikroszolgáltatásként. A rendszer célja, hogy a felhasználók biztonságosan igazolhassák személyazonosságukat anélkül, hogy személyes adataik nyilvánosságra kerülnének. A validációs folyamat során a felhasználó bizonyítékot szolgáltat az identitására, amelyet a blokklánc rögzít, miközben az érzékeny adatok off-chain tárolódnak. A rendszernek lehetőséget kell biztosítania az identitás igazolására más szolgáltatások számára, a tranzakciók és a hitelesítések naplózásával. További részletekért, technológiai kikötésekért egyeztetni szükséges. A téma leadása előtt egyeztetni szükséges.",
        "taken": false
    },
    {
        "title": "AI-vezérelt digitális oktatási mentor rendszer létrehozása",
        "description": "A feladat egy olyan keretrendszer megtervezése és megvalósítása, amely támogatja a diákok tanulási folyamatát egy folyamatosan elérhető, mesterséges intelligencia alapú oktatói modul segítségével. Az MI-komponens helyettesíthető például a ChatGPT-hez hasonló nagy nyelvi modellekkel. A rendszernek biztosítania kell a kérdés-válasz alapú interakciót, ahol a diák kérdéseket tehet fel, az oktató modul pedig magyarázatot ad, összefüggésekre mutat rá, és kapcsolódó témaköröket ismertet. Az oktatói modulnak képesnek kell lennie a diák tudásának felmérésére különböző feladatok és tesztek formájában, valamint azok értékelésére. A keretrendszer tartalmazzon olyan komponenseket, amelyek támogatják a diákok előrehaladásának és teljesítményének követését és dokumentálását. További technológiai részletek és specifikációk egyeztetést igényelnek. A téma véglegesítése előtt konzultáció szükséges.",
        "taken": false
    },
    {
        "title": "Blokklánc tranzakciós gráf elemzése képfeldolgozási eljárásokkal",
        "description": "A feladat blokkláncok tranzakciós adatainak megjelenítése gráfok segítségével, majd ezen gráfok elemzése képfeldolgozási eljárásokkal, problémás részek azonosítása.",
        "taken": true
    },
    {
        "title": "Szakmai hallgatói közösségépítésre szolgáló platform létrehozása",
        "description": "A feladat egy olyan platform létrehozása, ahol a hallgatók gamifikációs formában tudnak szakmaileg előremutató kapcsolatokat építeni jelenlegi hallgatótársaikkal. A rendszerben legyen lehetőség biztonságos, titkosított módon a hallgatóknak egymást értékelni. Dolgozzon ki egy rendszert, amiben a jó értékelést kapott hallgatók valamilyen módon kapcsolatba tudnak kerülni (tehát a kilétük felfedődik) az őket pozitívan értékelőkkel. Így az egymástól kapott elismerő szavakat akár valós szakmai közösségi profilokon is beválthatják pl. LinkedIn-en.<br><br>A megvalósítás folyamán használjon modern CSS keretrendszereket (pl. material ui, tailwind css, bootstrap) és ehhez ideálisan választott frontend keretrendszert (pl. vue, angular). A rendszerhez szükséges backend-et javasolt dotnet környezetben elkészíteni.",
        "taken": true
    },
    {
        "title": "ChatGPT integrálása chatbottal rendelkező webalkalmazásba",
        "description": "A feladat egy olyan chatbot létrehozása ami a chatGPT-t felhasználva (proxy tervezési mintához hasonlóan) segíti a felhasználót egy webalkalmazásban.<br><br>Részletekért, bővebb információért egyeztetés szükséges.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": true
    },
    {
        "title": "ChatGPT és Google translate fordítási eredményeinek összehasonlítása",
        "description": "A feladat, hogy hasonlítsa össze a Google translate (és egyéb fordító programok) által adott eredményeket a chatGPT által adott fordításokkal. A cél a fordított szöveg pontosságának elemzése, értékelése szemantikai szempontból.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": true
    },
    {
        "title": "Tananyag értékelő platform",
        "description": "A feladat elkészíteni egy olyan platformot, ahol moderátorok és céges partnerek tudnak tananyagokat kiírni, majd a hallgatók ezeket tudják értékelni hasznosság és egyéb szempontok alapján. A cél, hogy egy olyan értékelőrendszer legyen elérhető, ahol oktatótól függetlenül, csak a tananyagot, annak hasznosságát lehet vizsgálni és mérni egyetemi és ipari vonatkozásban. Hozzon létre egy CRUD felület ahol be lehet lépni a fentebb felsorolt szerepkörökben. A moderátor tananyagot tud felvinni, és minden meglévő dolgot módosítani. Céges képviselők tananyagokat tudnak kiírni. Hallgatók pedig csak értékelni tudják a tananyagokat. Értékelés alatt 1-5 csillaggal jelzett skálán lehet értékelni, illetve szöveges tartalmat is meg lehet/kell adni.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": true
    },
    {
        "title": "Digitális identitáskezelő rendszer blokklánc használatával",
        "description": "A blokklánc a digitális identitás felépítését lehetővé tevő technológia, amely decentralizált és biztonságos környezetet kínál. Hozzon létre egy C# alapú alkalmazást amiben okosszerződéseken (ehhez használja fel a Microsoft által biztosított SmartContract osztályt) keresztül, legyen lehetőség a rendszerbe felhasználóknak saját magukról adatokat rögzíteni. Ezen adatokat aztán egyéb alkalmazások, cégek, stb. el tudnak kérni.",
        "taken": true
    },
    {
        "title": "Chat alkalmazás létrehozása blokkláncon",
        "description": "A feladat egy olyan alkalmazás megalkotása amelyben két fél tud kommunikálni egymással, hasonlóan mint emailváltás esetén, viszont az egyes üzeneteket blokklánc és okosszerződés segítségével tárolja el, így biztonságossá téve az alkalmazást adatmanipuláció ellen.",
        "taken": true
    },
    {
        "title": "Influenszer követő-like korreláció vizsgálata, elemzése",
        "description": "A feladat megvizsgálni, hogy adott influenszer követőszáma és a posztokra adott like-ok száma (és kommentek száma) között milyen korreláció van. Ehhez készítsen egy olyan rendszert, ahol influenszer profil linket lehet megadni, ezt követően a rendszer a szükséges elemzéseket a háttérben lefuttatja, majd az eredményt megjeleníti.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": true
    },
    {
        "title": "Követők felderítése és elemzése szociális platformokon",
        "description": "A feladat egy olyan tool készítése, amely különböző web-scraping technológiákat (pl. BeautifulSoup, Selenium, Scrapy) összehasonlít és elemez. Ezekkel elkészít egy olyan elemzést, amely követőket figyel bizonyos profilokon, amelyet meg lehet adni a rendszernek.",
        "taken": true
    },
    {
        "title": "Közösségi profilok kapcsolatának gráfalapú reprezentációja",
        "description": "A feladat, egy olyan rendszer elkészítése amely begyűjtött közösségi profilokról szóló adatokat gráf-alapú reprezentációban rendez el, oly módon, hogy a kapcsolatok az egyes csomópontok (profilok) között valamilyen vonatkozásban összefüggnek a közösségi profilokkal. Például A személy követi B személyt, akkor A->B irányított kapcsolatról beszélhetünk. A rendszer legyen képes pillanatképeket is készíteni ezekről, így időben visszamenőleg 2 állapot (gráf) összehasonlítható kell legyen.",
        "taken": true
    }
]