[
    {
        "title": "Blokklánc tranzakciós gráf elemzése képfeldolgozási eljárásokkal",
        "description": "A feladat blokkláncok tranzakciós adatainak megjelenítése gráfok segítségével, majd ezen gráfok elemzése képfeldolgozási eljárásokkal, problémás részek azonosítása.",
        "taken": false
    },
    {
        "title": "Szakmai hallgatói közösségépítésre szolgáló platform létrehozása",
        "description": "A feladat egy olyan platform létrehozása, ahol a hallgatók gamifikációs formában tudnak szakmaileg előremutató kapcsolatokat építeni jelenlegi hallgatótársaikkal. A rendszerben legyen lehetőség biztonságos, titkosított módon a hallgatóknak egymást értékelni. Dolgozzon ki egy rendszert, amiben a jó értékelést kapott hallgatók valamilyen módon kapcsolatba tudnak kerülni (tehát a kilétük felfedődik) az őket pozitívan értékelőkkel. Így az egymástól kapott elismerő szavakat akár valós szakmai közösségi profilokon is beválthatják pl. LinkedIn-en.<br><br>A megvalósítás folyamán használjon modern CSS keretrendszereket (pl. material ui, tailwind css, bootstrap) és ehhez ideálisan választott frontend keretrendszert (pl. vue, angular). A rendszerhez szükséges backend-et javasolt dotnet környezetben elkészíteni.",
        "taken": false
    },
    {
        "title": "ChatGPT integrálása chatbottal rendelkező webalkalmazásba",
        "description": "A feladat egy olyan chatbot létrehozása ami a chatGPT-t felhasználva (proxy tervezési mintához hasonlóan) segíti a felhasználót egy webalkalmazásban.<br><br>Részletekért, bővebb információért egyeztetés szükséges.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": true
    },
    {
        "title": "ChatGPT és Google translate fordítási eredményeinek összehasonlítása",
        "description": "A feladat, hogy hasonlítsa össze a Google translate (és egyéb fordító programok) által adott eredményeket a chatGPT által adott fordításokkal. A cél a fordított szöveg pontosságának elemzése, értékelése szemantikai szempontból.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": false
    },
    {
        "title": "Tananyag értékelő platform",
        "description": "A feladat elkészíteni egy olyan platformot, ahol moderátorok és céges partnerek tudnak tananyagokat kiírni, majd a hallgatók ezeket tudják értékelni hasznosság és egyéb szempontok alapján. A cél, hogy egy olyan értékelőrendszer legyen elérhető, ahol oktatótól függetlenül, csak a tananyagot, annak hasznosságát lehet vizsgálni és mérni egyetemi és ipari vonatkozásban. Hozzon létre egy CRUD felület ahol be lehet lépni a fentebb felsorolt szerepkörökben. A moderátor tananyagot tud felvinni, és minden meglévő dolgot módosítani. Céges képviselők tananyagokat tudnak kiírni. Hallgatók pedig csak értékelni tudják a tananyagokat. Értékelés alatt 1-5 csillaggal jelzett skálán lehet értékelni, illetve szöveges tartalmat is meg lehet/kell adni.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": true
    },
    {
        "title": "Digitális identitáskezelő rendszer blokklánc használatával",
        "description": "A blokklánc a digitális identitás felépítését lehetővé tevő technológia, amely decentralizált és biztonságos környezetet kínál. Hozzon létre egy C# alapú alkalmazást amiben okosszerződéseken (ehhez használja fel a Microsoft által biztosított SmartContract osztályt) keresztül, legyen lehetőség a rendszerbe felhasználóknak saját magukról adatokat rögzíteni. Ezen adatokat aztán egyéb alkalmazások, cégek, stb. el tudnak kérni.",
        "taken": false
    },
    {
        "title": "Chat alkalmazás létrehozása blokkláncon",
        "description": "A feladat egy olyan alkalmazás megalkotása amelyben két fél tud kommunikálni egymással, hasonlóan mint emailváltás esetén, viszont az egyes üzeneteket blokklánc és okosszerződés segítségével tárolja el, így biztonságossá téve az alkalmazást adatmanipuláció ellen.",
        "taken": false
    },
    {
        "title": "Influenszer követő-like korreláció vizsgálata, elemzése",
        "description": "A feladat megvizsgálni, hogy adott influenszer követőszáma és a posztokra adott like-ok száma (és kommentek száma) között milyen korreláció van. Ehhez készítsen egy olyan rendszert, ahol influenszer profil linket lehet megadni, ezt követően a rendszer a szükséges elemzéseket a háttérben lefuttatja, majd az eredményt megjeleníti.<br><br>Elvárt használandó keretrendszerek: asp.net, angular/vue (vagy egyeztetés szükséges).",
        "taken": false
    },
    {
        "title": "Követők felderítése és elemzése szociális platformokon",
        "description": "A feladat egy olyan tool készítése, amely különböző web-scraping technológiákat (pl. BeautifulSoup, Selenium, Scrapy) összehasonlít és elemez. Ezekkel elkészít egy olyan elemzést, amely követőket figyel bizonyos profilokon, amelyet meg lehet adni a rendszernek.",
        "taken": true
    },
    {
        "title": "Közösségi profilok kapcsolatának gráfalapú reprezentációja",
        "description": "A feladat, egy olyan rendszer elkészítése amely begyűjtött közösségi profilokról szóló adatokat gráf-alapú reprezentációban rendez el, oly módon, hogy a kapcsolatok az egyes csomópontok (profilok) között valamilyen vonatkozásban összefüggnek a közösségi profilokkal. Például A személy követi B személyt, akkor A->B irányított kapcsolatról beszélhetünk. A rendszer legyen képes pillanatképeket is készíteni ezekről, így időben visszamenőleg 2 állapot (gráf) összehasonlítható kell legyen.",
        "taken": true
    }
]
